Autodesk.Revit.UI.RibbonItemType
An enumerated type listing all the toolbar item styles.

Autodesk.Revit.UI.RibbonItemType.TextBox
A text-based control that allows the user to enter text.

Autodesk.Revit.UI.RibbonItemType.ComboBox
A selection control with a drop-down list that can be shown or hidden by clicking the arrow on the control.

Autodesk.Revit.UI.RibbonItemType.ComboBoxMember
An item in the drop-down list of a ComboBox.

Autodesk.Revit.UI.RibbonItemType.RadioButtonGroup
An item that contains a collection of RibbonToggleButton items.

Autodesk.Revit.UI.RibbonItemType.ToggleButton
A standard button that can be added to RadioButtonGroup.

Autodesk.Revit.UI.RibbonItemType.SplitButton
A split button with a default button and a pull-down menu list.

Autodesk.Revit.UI.RibbonItemType.PulldownButton
A button with a pull-down menu list.

Autodesk.Revit.UI.RibbonItemType.PushButton
A standard button with text and image.